app/views/users/show.html.erb

      <h3>Current Subscriptions</h3>
      <% if @user.order_options.any? %>
---
SELECT 1 AS one FROM "order_options" WHERE "order_options"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "order_options".* FROM "order_options" WHERE "order_options"."user_id" = $1  [["user_id", 1]]