app/helpers/vehicle_helper.rb

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 82], ["LIMIT", 1]]
---
    def get_vehicle_name(vehicle_id)
        vehicle = Vehicle.find(vehicle_id)