app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "order_options".* FROM "order_options" WHERE "order_options"."user_id" = $1 ORDER BY "order_options"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id])
    @order_options = @user.order_options

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save