app/controllers/vehicles_controller.rb

SELECT "order_options".* FROM "order_options" WHERE "order_options"."user_id" = $1 AND "order_options"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 17], ["LIMIT", 1]]
DELETE FROM "order_options" WHERE "order_options"."id" = $1  [["id", 16]]
---
    def destroy
        order = current_user.order_options.find_by(id: params[:id])
        vehicle_id = order.vehicle_id
        return redirect_to user_path(id: current_user.id) if order.nil?

        #Cancel the Stripe subscription
        Stripe::Subscription.delete(order.subscription_id)