app/controllers/vehicles_controller.rb

SELECT "vehicles"."make" FROM "vehicles"
---
    def new
        @makes = Vehicle.select(:id,:make).group(:id,:make)

INSERT INTO "order_options" ("frequency", "quality", "created_at", "updated_at", "user_id", "vehicle_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["frequency", 1], ["quality", 1], ["created_at", "2020-04-15 04:17:32.668494"], ["updated_at", "2020-04-15 04:17:32.668494"], ["user_id", 1], ["vehicle_id", 82]]
---
    def create
        @order_option = current_user.order_options.build(add_vehicle_params)
        if @order_option.save

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 119], ["LIMIT", 1]]
SELECT DISTINCT "vehicles".* FROM "vehicles" WHERE "vehicles"."make" = $1 AND "vehicles"."model" = $2  [["make", "Mrs. Cherry Kessler"], ["model", "Teofila Champlin II"]]
---
    def get_models_by_make
        make = Vehicle.find(params[:id]).make
        @models = Vehicle.where(make: make).distinct

SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 120], ["LIMIT", 1]]
SELECT DISTINCT "vehicles".* FROM "vehicles" WHERE "vehicles"."make" = $1 AND "vehicles"."model" = $2  [["make", "Lionel Shanahan"], ["model", "Vance Spinka"]]
---
    def get_years_by_model
        row = Vehicle.find(params[:id])
        make = row.make
        model = row.model
        @years = Vehicle.where(make: make, model: model).distinct

SELECT "order_options".* FROM "order_options" WHERE "order_options"."user_id" = $1 AND "order_options"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 17], ["LIMIT", 1]]
---
        def correct_user
            @subscription = current_user.order_options.find_by(id: params[:id])