app/models/user.rb

UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", nil], ["updated_at", "2020-04-07 03:37:28.979635"], ["id", 1]]
---
  def send_activation_email
    #Create and save a digest
    self.activation_token  = User.new_token
    self.activation_digest = User.digest(activation_token)
    self.save